This is related to `writeOnlyProperties` which is now handled properly thanks to #1737.

Tested on v1.4.0:

```
awscc_iam_role.main: Refreshing state... [id=PFE5Ch2mjmCKXYiO1AVT5U4HG-1cMxZNSeMSVs]
awscc_lambda_function.main: Refreshing state... [id=lambda_function_name]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # awscc_lambda_function.main will be updated in-place
  ~ resource "awscc_lambda_function" "main" {
      ~ code                           = {
          + image_uri         = (known after apply)
          + s3_bucket         = (known after apply)
          + s3_key            = (known after apply)
          + s3_object_version = (known after apply)
          ~ zip_file          = <<-EOT
                def lambda_handler(event,context):
              -   print("Hello World!")
              +   print("Hello World v2!")
                  return
            EOT
        }
      + code_signing_config_arn        = (known after apply)
      + dead_letter_config             = (known after apply)
      + file_system_configs            = (known after apply)
        id                             = "lambda_function_name"
      + image_config                   = (known after apply)
      + kms_key_arn                    = (known after apply)
      + layers                         = (known after apply)
      + reserved_concurrent_executions = (known after apply)
      + tags                           = (known after apply)
        # (18 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
awscc_lambda_function.main: Modifying... [id=lambda_function_name]
awscc_lambda_function.main: Still modifying... [id=lambda_function_name, 10s elapsed]
awscc_lambda_function.main: Modifications complete after 14s [id=lambda_function_name]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

I am going to close this now.